# Дан список. Сделать список с помощью функции map, которая переводит каждое
# число из исходного списка в строку

some_list = [1, 2, 3, 4, 5, 6, 7, 8]

print(list(map(str, some_list)))
